`timescale 1ns / 1ps

module ov5640_init (
    // ᠠ关键修改：取消 parameter，改为动态输入端口
    input  wire        rot_180_en,  // 0: 正常 0度, 1: 翻转 180度
    
    input  wire [9:0]  lut_index,
    output reg  [31:0] lut_data
);

// 在 ov5640_init.v 中，找到 reg_3820_val 的定义并修改为：
wire [7:0] reg_3820_val = 8'h47; // 强制保持原始 0度 画面，关闭硬件翻转

always @(*) begin
    case(lut_index)
        10'd0   : lut_data = {8'h78, 16'h3103, 8'h11};
        10'd1   : lut_data = {8'h78, 16'h3008, 8'h82}; // 软复位
        10'd2   : lut_data = {8'h78, 16'h3008, 8'h42}; // 掉电模式
        10'd3   : lut_data = {8'h78, 16'h3103, 8'h03};
        10'd4   : lut_data = {8'h78, 16'h3017, 8'hff}; // 降低 D[7:0] 的驱动强度，减少跳变噪声
        10'd5   : lut_data = {8'h78, 16'h3018, 8'hff}; // 降低 PCLK/HREF 等的驱动强度，防止时钟毛刺
        10'd6   : lut_data = {8'h78, 16'h3034, 8'h1a};
        10'd7   : lut_data = {8'h78, 16'h3037, 8'h13};
        10'd8   : lut_data = {8'h78, 16'h3108, 8'h01};
        10'd9   : lut_data = {8'h78, 16'h3630, 8'h36};
        10'd10  : lut_data = {8'h78, 16'h3631, 8'h0e};
        10'd11  : lut_data = {8'h78, 16'h3632, 8'he2};
        10'd12  : lut_data = {8'h78, 16'h3633, 8'h12};
        10'd13  : lut_data = {8'h78, 16'h3621, 8'he0};
        10'd14  : lut_data = {8'h78, 16'h3704, 8'ha0};
        10'd15  : lut_data = {8'h78, 16'h3703, 8'h5a};
        10'd16  : lut_data = {8'h78, 16'h3715, 8'h78};
        10'd17  : lut_data = {8'h78, 16'h3717, 8'h01};
        10'd18  : lut_data = {8'h78, 16'h370b, 8'h60};
        10'd19  : lut_data = {8'h78, 16'h3705, 8'h1a};
        10'd20  : lut_data = {8'h78, 16'h3905, 8'h02};
        10'd21  : lut_data = {8'h78, 16'h3906, 8'h10};
        10'd22  : lut_data = {8'h78, 16'h3901, 8'h0a};
        10'd23  : lut_data = {8'h78, 16'h3731, 8'h12};
        10'd24  : lut_data = {8'h78, 16'h3600, 8'h08};
        10'd25  : lut_data = {8'h78, 16'h3601, 8'h33};
        10'd26  : lut_data = {8'h78, 16'h302d, 8'h60};
        10'd27  : lut_data = {8'h78, 16'h3620, 8'h52};
        10'd28  : lut_data = {8'h78, 16'h371b, 8'h20};
        10'd29  : lut_data = {8'h78, 16'h471c, 8'h50};
        10'd30  : lut_data = {8'h78, 16'h3a13, 8'h43};
        10'd31  : lut_data = {8'h78, 16'h3a18, 8'h00};
        10'd32  : lut_data = {8'h78, 16'h3a19, 8'h40}; // 压制增益上限
        10'd33  : lut_data = {8'h78, 16'h3635, 8'h13};
        10'd34  : lut_data = {8'h78, 16'h3636, 8'h03};
        10'd35  : lut_data = {8'h78, 16'h3634, 8'h40};
        10'd36  : lut_data = {8'h78, 16'h3622, 8'h01};
        10'd37  : lut_data = {8'h78, 16'h3c01, 8'h34};
        10'd38  : lut_data = {8'h78, 16'h3c04, 8'h28};
        10'd39  : lut_data = {8'h78, 16'h3c05, 8'h98};
        10'd40  : lut_data = {8'h78, 16'h3c06, 8'h00};
        10'd41  : lut_data = {8'h78, 16'h3c07, 8'h08};
        10'd42  : lut_data = {8'h78, 16'h3c08, 8'h00};
        // 设定为 50Hz 抗频闪
        10'd43  : lut_data = {8'h78, 16'h3c07, 8'h08};
        10'd44  : lut_data = {8'h78, 16'h3c0a, 8'h9c};
        10'd45  : lut_data = {8'h78, 16'h3c0b, 8'h40};
        10'd46  : lut_data = {8'h78, 16'h3810, 8'h00};
        10'd47  : lut_data = {8'h78, 16'h3811, 8'h10};
        10'd48  : lut_data = {8'h78, 16'h3812, 8'h00};
        10'd49  : lut_data = {8'h78, 16'h3708, 8'h64};
        10'd50  : lut_data = {8'h78, 16'h4001, 8'h02};
        10'd51  : lut_data = {8'h78, 16'h4005, 8'h1a};
        10'd52  : lut_data = {8'h78, 16'h3000, 8'h00};
        10'd53  : lut_data = {8'h78, 16'h3004, 8'hff};
        10'd54  : lut_data = {8'h78, 16'h300e, 8'h58};
        10'd55  : lut_data = {8'h78, 16'h302e, 8'h00};
        10'd56  : lut_data = {8'h78, 16'h4300, 8'h61}; // RGB565
        10'd57  : lut_data = {8'h78, 16'h501f, 8'h01};
        10'd58  : lut_data = {8'h78, 16'h440e, 8'h00};
        10'd59  : lut_data = {8'h78, 16'h5000, 8'h27}; // 关闭LENC，消灭过曝变紫和色彩断层！
        10'd60  : lut_data = {8'h78, 16'h3a0f, 8'h30};
        10'd61  : lut_data = {8'h78, 16'h3a10, 8'h28};
        10'd62  : lut_data = {8'h78, 16'h3a1b, 8'h30};
        10'd63  : lut_data = {8'h78, 16'h3a1e, 8'h26};
        10'd64  : lut_data = {8'h78, 16'h3a11, 8'h60};
        10'd65  : lut_data = {8'h78, 16'h3a1f, 8'h14};
        10'd66  : lut_data = {8'h78, 16'h5800, 8'h23};
        10'd67  : lut_data = {8'h78, 16'h5801, 8'h14};
        10'd68  : lut_data = {8'h78, 16'h5802, 8'h0f};
        10'd69  : lut_data = {8'h78, 16'h5803, 8'h0f};
        10'd70  : lut_data = {8'h78, 16'h5804, 8'h12};
        10'd71  : lut_data = {8'h78, 16'h5805, 8'h26};
        10'd72  : lut_data = {8'h78, 16'h5806, 8'h0c};
        10'd73  : lut_data = {8'h78, 16'h5807, 8'h08};
        10'd74  : lut_data = {8'h78, 16'h5808, 8'h05};
        10'd75  : lut_data = {8'h78, 16'h5809, 8'h05};
        10'd76  : lut_data = {8'h78, 16'h580a, 8'h08};
        10'd77  : lut_data = {8'h78, 16'h580b, 8'h0d};
        10'd78  : lut_data = {8'h78, 16'h580c, 8'h08};
        10'd79  : lut_data = {8'h78, 16'h580d, 8'h03};
        10'd80  : lut_data = {8'h78, 16'h580e, 8'h00};
        10'd81  : lut_data = {8'h78, 16'h580f, 8'h00};
        10'd82  : lut_data = {8'h78, 16'h5810, 8'h03};
        10'd83  : lut_data = {8'h78, 16'h5811, 8'h09};
        10'd84  : lut_data = {8'h78, 16'h5812, 8'h07};
        10'd85  : lut_data = {8'h78, 16'h5813, 8'h03};
        10'd86  : lut_data = {8'h78, 16'h5814, 8'h00};
        10'd87  : lut_data = {8'h78, 16'h5815, 8'h01};
        10'd88  : lut_data = {8'h78, 16'h5816, 8'h03};
        10'd89  : lut_data = {8'h78, 16'h5817, 8'h08};
        10'd90  : lut_data = {8'h78, 16'h5818, 8'h0d};
        10'd91  : lut_data = {8'h78, 16'h5819, 8'h08};
        10'd92  : lut_data = {8'h78, 16'h581a, 8'h05};
        10'd93  : lut_data = {8'h78, 16'h581b, 8'h06};
        10'd94  : lut_data = {8'h78, 16'h581c, 8'h08};
        10'd95  : lut_data = {8'h78, 16'h581d, 8'h0e};
        10'd96  : lut_data = {8'h78, 16'h581e, 8'h29};
        10'd97  : lut_data = {8'h78, 16'h581f, 8'h17};
        10'd98  : lut_data = {8'h78, 16'h5820, 8'h11};
        10'd99  : lut_data = {8'h78, 16'h5821, 8'h11};
        10'd100 : lut_data = {8'h78, 16'h5822, 8'h15};
        10'd101 : lut_data = {8'h78, 16'h5823, 8'h28};
        10'd102 : lut_data = {8'h78, 16'h5824, 8'h46};
        10'd103 : lut_data = {8'h78, 16'h5825, 8'h26};
        10'd104 : lut_data = {8'h78, 16'h5826, 8'h08};
        10'd105 : lut_data = {8'h78, 16'h5827, 8'h26};
        10'd106 : lut_data = {8'h78, 16'h5828, 8'h64};
        10'd107 : lut_data = {8'h78, 16'h5829, 8'h26};
        10'd108 : lut_data = {8'h78, 16'h582a, 8'h24};
        10'd109 : lut_data = {8'h78, 16'h582b, 8'h22};
        10'd110 : lut_data = {8'h78, 16'h582c, 8'h24};
        10'd111 : lut_data = {8'h78, 16'h582d, 8'h24};
        10'd112 : lut_data = {8'h78, 16'h582e, 8'h06};
        10'd113 : lut_data = {8'h78, 16'h582f, 8'h22};
        10'd114 : lut_data = {8'h78, 16'h5830, 8'h40};
        10'd115 : lut_data = {8'h78, 16'h5831, 8'h42};
        10'd116 : lut_data = {8'h78, 16'h5832, 8'h24};
        10'd117 : lut_data = {8'h78, 16'h5833, 8'h26};
        10'd118 : lut_data = {8'h78, 16'h5834, 8'h24};
        10'd119 : lut_data = {8'h78, 16'h5835, 8'h22};
        10'd120 : lut_data = {8'h78, 16'h5836, 8'h22};
        10'd121 : lut_data = {8'h78, 16'h5837, 8'h26};
        10'd122 : lut_data = {8'h78, 16'h5838, 8'h44};
        10'd123 : lut_data = {8'h78, 16'h5839, 8'h24};
        10'd124 : lut_data = {8'h78, 16'h583a, 8'h26};
        10'd125 : lut_data = {8'h78, 16'h583b, 8'h28};
        10'd126 : lut_data = {8'h78, 16'h583c, 8'h42};
        10'd127 : lut_data = {8'h78, 16'h583d, 8'hce};
        10'd128 : lut_data = {8'h78, 16'h5180, 8'hff};
        10'd129 : lut_data = {8'h78, 16'h5181, 8'hf2};
        10'd130 : lut_data = {8'h78, 16'h5182, 8'h00};
        10'd131 : lut_data = {8'h78, 16'h5183, 8'h14};
        10'd132 : lut_data = {8'h78, 16'h5184, 8'h25};
        10'd133 : lut_data = {8'h78, 16'h5185, 8'h24};
        10'd134 : lut_data = {8'h78, 16'h5186, 8'h09};
        10'd135 : lut_data = {8'h78, 16'h5187, 8'h09};
        10'd136 : lut_data = {8'h78, 16'h5188, 8'h09};
        10'd137 : lut_data = {8'h78, 16'h5189, 8'h75};
        10'd138 : lut_data = {8'h78, 16'h518a, 8'h54};
        10'd139 : lut_data = {8'h78, 16'h518b, 8'he0};
        10'd140 : lut_data = {8'h78, 16'h518c, 8'hb2};
        10'd141 : lut_data = {8'h78, 16'h518d, 8'h42};
        10'd142 : lut_data = {8'h78, 16'h518e, 8'h3d};
        10'd143 : lut_data = {8'h78, 16'h518f, 8'h56};
        10'd144 : lut_data = {8'h78, 16'h5190, 8'h46};
        10'd145 : lut_data = {8'h78, 16'h5191, 8'hf8};
        10'd146 : lut_data = {8'h78, 16'h5192, 8'h04};
        10'd147 : lut_data = {8'h78, 16'h5193, 8'h70};
        10'd148 : lut_data = {8'h78, 16'h5194, 8'hf0};
        10'd149 : lut_data = {8'h78, 16'h5195, 8'hf0};
        10'd150 : lut_data = {8'h78, 16'h5196, 8'h03};
        10'd151 : lut_data = {8'h78, 16'h5197, 8'h01};
        10'd152 : lut_data = {8'h78, 16'h5198, 8'h04};
        10'd153 : lut_data = {8'h78, 16'h5199, 8'h12};
        10'd154 : lut_data = {8'h78, 16'h519a, 8'h04};
        10'd155 : lut_data = {8'h78, 16'h519b, 8'h00};
        10'd156 : lut_data = {8'h78, 16'h519c, 8'h06};
        10'd157 : lut_data = {8'h78, 16'h519d, 8'h82};
        10'd158 : lut_data = {8'h78, 16'h519e, 8'h38};
        10'd159 : lut_data = {8'h78, 16'h5480, 8'h01};
        10'd160 : lut_data = {8'h78, 16'h5481, 8'h08};
        10'd161 : lut_data = {8'h78, 16'h5482, 8'h14};
        10'd162 : lut_data = {8'h78, 16'h5483, 8'h28};
        10'd163 : lut_data = {8'h78, 16'h5484, 8'h51};
        10'd164 : lut_data = {8'h78, 16'h5485, 8'h65};
        10'd165 : lut_data = {8'h78, 16'h5486, 8'h71};
        10'd166 : lut_data = {8'h78, 16'h5487, 8'h7d};
        10'd167 : lut_data = {8'h78, 16'h5488, 8'h87};
        10'd168 : lut_data = {8'h78, 16'h5489, 8'h91};
        10'd169 : lut_data = {8'h78, 16'h548a, 8'h9a};
        10'd170 : lut_data = {8'h78, 16'h548b, 8'haa};
        10'd171 : lut_data = {8'h78, 16'h548c, 8'hb8};
        10'd172 : lut_data = {8'h78, 16'h548d, 8'hcd};
        10'd173 : lut_data = {8'h78, 16'h548e, 8'hdd};
        10'd174 : lut_data = {8'h78, 16'h548f, 8'hea};
        10'd175 : lut_data = {8'h78, 16'h5490, 8'h1d};
        10'd176 : lut_data = {8'h78, 16'h5381, 8'h1e};
        10'd177 : lut_data = {8'h78, 16'h5382, 8'h5b};
        10'd178 : lut_data = {8'h78, 16'h5383, 8'h08};
        10'd179 : lut_data = {8'h78, 16'h5384, 8'h0a};
        10'd180 : lut_data = {8'h78, 16'h5385, 8'h7e};
        10'd181 : lut_data = {8'h78, 16'h5386, 8'h88};
        10'd182 : lut_data = {8'h78, 16'h5387, 8'h7c};
        10'd183 : lut_data = {8'h78, 16'h5388, 8'h6c};
        10'd184 : lut_data = {8'h78, 16'h5389, 8'h10};
        10'd185 : lut_data = {8'h78, 16'h538a, 8'h01};
        10'd186 : lut_data = {8'h78, 16'h538b, 8'h98};
        10'd187 : lut_data = {8'h78, 16'h5580, 8'h06};
        // 恢复原厂宽广的曝光上限
        10'd188 : lut_data = {8'h78, 16'h3a0f, 8'h30}; 
        10'd189 : lut_data = {8'h78, 16'h3a10, 8'h28}; 
        10'd190 : lut_data = {8'h78, 16'h3a1b, 8'h30}; 
        10'd191 : lut_data = {8'h78, 16'h3a1e, 8'h26};
        10'd192 : lut_data = {8'h78, 16'h558b, 8'hf8};
        10'd193 : lut_data = {8'h78, 16'h501d, 8'h40};
        10'd194 : lut_data = {8'h78, 16'h5300, 8'h08};
        10'd195 : lut_data = {8'h78, 16'h5301, 8'h30};
        10'd196 : lut_data = {8'h78, 16'h5302, 8'h10};
        10'd197 : lut_data = {8'h78, 16'h5303, 8'h00};
        10'd198 : lut_data = {8'h78, 16'h5304, 8'h08};
        10'd199 : lut_data = {8'h78, 16'h5305, 8'h30};
        10'd200 : lut_data = {8'h78, 16'h5306, 8'h08};
        10'd201 : lut_data = {8'h78, 16'h5307, 8'h16};
        10'd202 : lut_data = {8'h78, 16'h5309, 8'h08};
        10'd203 : lut_data = {8'h78, 16'h530a, 8'h30};
        10'd204 : lut_data = {8'h78, 16'h530b, 8'h04};
        10'd205 : lut_data = {8'h78, 16'h530c, 8'h06};
        10'd206 : lut_data = {8'h78, 16'h5025, 8'h00};
        
        // ---- 唤醒 ----
        10'd207 : lut_data = {8'h78, 16'h3008, 8'h02};
        
        10'd208 : lut_data = {8'h78, 16'h3035, 8'h21};
        10'd209 : lut_data = {8'h78, 16'h3036, 8'h69};
        10'd210 : lut_data = {8'h78, 16'h3c07, 8'h07};

        // ==========================================
        // ᠠ关键修改：动态接管 0x3820 寄存器，控制画面翻转
        // ==========================================
        // ᠠ关键修改：动态写入寄存器
        10'd211 : lut_data = {8'h78, 16'h3820, reg_3820_val};

        10'd212 : lut_data = {8'h78, 16'h3821, 8'h00}; // 镜像
        10'd213 : lut_data = {8'h78, 16'h3814, 8'h31};
        10'd214 : lut_data = {8'h78, 16'h3815, 8'h31};
        10'd215 : lut_data = {8'h78, 16'h3800, 8'h00};
        10'd216 : lut_data = {8'h78, 16'h3801, 8'h00};
        10'd217 : lut_data = {8'h78, 16'h3802, 8'h00};
        10'd218 : lut_data = {8'h78, 16'h3803, 8'hfa};
        10'd219 : lut_data = {8'h78, 16'h3804, 8'h0a};
        10'd220 : lut_data = {8'h78, 16'h3805, 8'h3f};
        10'd221 : lut_data = {8'h78, 16'h3806, 8'h06};
        10'd222 : lut_data = {8'h78, 16'h3807, 8'ha9};
        10'd223 : lut_data = {8'h78, 16'h3808, 8'h05};
        10'd224 : lut_data = {8'h78, 16'h3809, 8'h00};
        10'd225 : lut_data = {8'h78, 16'h380a, 8'h02};
        10'd226 : lut_data = {8'h78, 16'h380b, 8'hd0};
        10'd227 : lut_data = {8'h78, 16'h380c, 8'h07};
        10'd228 : lut_data = {8'h78, 16'h380d, 8'h64};
        10'd229 : lut_data = {8'h78, 16'h380e, 8'h02};
        10'd230 : lut_data = {8'h78, 16'h380f, 8'he4};
        10'd231 : lut_data = {8'h78, 16'h3813, 8'h04};
        10'd232 : lut_data = {8'h78, 16'h3618, 8'h00};
        10'd233 : lut_data = {8'h78, 16'h3612, 8'h29};
        10'd234 : lut_data = {8'h78, 16'h3709, 8'h52};
        10'd235 : lut_data = {8'h78, 16'h370c, 8'h03};
        10'd236 : lut_data = {8'h78, 16'h3a02, 8'h02};
        10'd237 : lut_data = {8'h78, 16'h3a03, 8'he0};
        10'd238 : lut_data = {8'h78, 16'h3a14, 8'h02};
        10'd239 : lut_data = {8'h78, 16'h3a15, 8'he0};
        10'd240 : lut_data = {8'h78, 16'h4004, 8'h02};
        10'd241 : lut_data = {8'h78, 16'h3002, 8'h1c};
        10'd242 : lut_data = {8'h78, 16'h3006, 8'hc3};
        10'd243 : lut_data = {8'h78, 16'h4713, 8'h03};
        10'd244 : lut_data = {8'h78, 16'h4407, 8'h04};
        10'd245 : lut_data = {8'h78, 16'h460b, 8'h37};
        10'd246 : lut_data = {8'h78, 16'h460c, 8'h20};
        10'd247 : lut_data = {8'h78, 16'h4837, 8'h16};
        10'd248 : lut_data = {8'h78, 16'h3824, 8'h04};
        // 开启 CMX 色彩矩阵，保证颜色平滑，亮部不会过曝变紫
        10'd249 : lut_data = {8'h78, 16'h5001, 8'ha3};
        10'd250 : lut_data = {8'h78, 16'h3503, 8'h00};
        
        // =======================================================
        // ᐠ终极画质补丁：压制噪点 + 消除日光灯横纹
        // =======================================================
        // 1. 强制开启 50Hz 抗频闪
        10'd251 : lut_data = {8'h78, 16'h3a00, 8'h38}; 
        10'd252 : lut_data = {8'h78, 16'h3c00, 8'h04}; 
        10'd253 : lut_data = {8'h78, 16'h3c01, 8'h80}; 

        // 2. 限制 AGC 最高上限
        10'd254 : lut_data = {8'h78, 16'h3a18, 8'h00}; 
        10'd255 : lut_data = {8'h78, 16'h3a19, 8'h40}; 

        // 3. 开启内部 2D 降噪
        10'd256 : lut_data = {8'h78, 16'h5308, 8'h25}; 
        
        // 结束标志
        10'd257 : lut_data = {8'hFF, 16'h0000, 8'h00};
        default : lut_data = {8'hFF, 16'h0000, 8'h00};
    endcase
end

endmodule
